mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Holtek</vendor>
  <name>HT32_DFP</name>
  <description>Holtek HT32 Family Support</description>
  <url>http://mcu.holtek.com.tw/pack</url>
  <!-- optional license file -->
  <!--
  <license>
  </license>
  -->

  <releases>
    <release version="1.0.20" date="2019-07-25">
      1. Add new device: HT50F32002, HT5032003, HT32F61352.
      2. Add 46QFN package of HT32F50220/50230/50231/50241.
      3. Update "startup_ht32fxxxxx_nn.s" and "system_ht32fxxxxx_nn.c".
    </release>
    <release version="1.0.19" date="2019-07-02">
      1. Update system_ht32fxxxx_xx.c.
      2. Add new device: HT32F52142, HT32F50343, HT32F12364.
      3. Add startup_ht32f5xxxx_06.s, system_ht32f5xxxx_06.c, startup_ht32f1xxxx_03.s, system_ht32f1xxxx_03.c.
      4. Add board support: ESK32-30106/30502/30503/30504/30505/30506/30507/30508/30509.
      5. Add LED Blinky examples for ESK32-30106/30502/30503/30504/30505/30506/30507/30508/30509.
      6. Update "ht32_op.s".
    </release>
    <release version="1.0.18" date="2019-04-27">
      1. Add board support: ESK32-30105, ESK32-30501.
      2. Add LED Blinky examples for ESK32-30105 and ESK32-30501.
    </release>
    <release version="1.0.17" date="2019-04-02">
      1. Add new device: HT32F65240, HT32F52357/52367, HT32F57331/57341, HT32F57342/57352.
      2. Modify SVD files of HT32F52342/52352, HT32F12345 and HT32F12356_66.
      3. Update "ht32f5xxxx_01.h".
    </release>
    <release version="1.0.16" date="2018-07-14">
      1. Update ht32_op.s.
      2. Update package information of HT32F50220/50230/50231/50241.
    </release>
    <release version="1.0.15" date="2018-04-28">
      1. Modify SRAM from 8 KB to 16 KB of HT32F0006.
      2. Update SVD file of HT32F52342/523252.
      3. Add new device: HT32F52344/52354.
    </release>
    <release version="1.0.14" date="2018-01-03">
      1. Update startup_ht32fxxxx_xx.s and system_ht32fxxxx_xx.c.
    </release>
    <release version="1.0.13" date="2017-12-06">
      1. Add new device: HT32F50231, HT32F50241.
    </release>
    <release version="1.0.12" date="2017-11-23">
      1. Add new device: HT32F0006.
      2. Add new device: HT32F50220, HT32F50230.
      3. Fix SVD compiler error of HT32F52342/52352.
    </release>
    <release version="1.0.11" date="2017-10-16">
      1. Update startup related files.
      2. Add preliminary version of System View (SVD/SFR) for HT32F52342/52352.
    </release>
    <release version="1.0.10" date="2017-09-03">
      1. Fix memory size error.
    </release>
    <release version="1.0.9" date="2017-08-31">
      1. Add device name to compatible with previous Firmwarw Library project setting.
      2. Add new device: HT32F5826, HT32F0008.
    </release>
    <release version="1.0.8" date="2017-07-13">
      1. Fix device name issue (space is not allow).
    </release>
    <release version="1.0.7" date="2017-07-03">
      1. Add Compiler define.
      2. Update description of each device.
    </release>
    <release version="1.0.6" date="2017-05-31">
      1. Add new device: HT32F12345, HT32F52243, HT32F52253.
      2. Update HT32F12365, HT32F12366, HT32F22366, HT32F165x related files.
    </release>
    <release version="1.0.5" date="2016-11-24">
      1. Update Datasheet and User Manual document.
      2. Add new device: HT32F12365, HT32F12366, HT32F22366.
    </release>
    <release version="1.0.4" date="2016-06-20">
      1. Update Datasheet and User Manual document.
      2. Update IROM size error.
    </release>
    <release version="1.0.3" date="2016-04-14">
      1. Update HT32F52220/52230 document.
      2. Add 33QFN package information for HT32F52220/52230.
    </release>
    <release version="1.0.2" date="2016-03-03">
      Fix SVD error.
    </release>
    <release version="1.0.1" date="2016-02-16">
      Added: HT32F52331, HT32F52341, HT32F52342, HT32F52352 devices.
    </release>
    <release version="1.0.0" date="2015-03-23">
      First Release version of HT32 Device Family Pack.
      Contains the following Devices:HT32F1251,HT32F1253,HT32F1252,HT32F1251,HT32F1251B
                                     HT32F1755,HT32F1765,HT32F2755
                                     HT32F1655,HT32F1656,HT32F1653,HT32F1654
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>HOLTEK</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Holtek</keyword>
    <keyword>HT32 Family</keyword>
    <keyword>HT32</keyword>
  </keywords>

  <devices>

  <!-- ************************  Series 'HT32F125x'  **************************** -->
    <family Dfamily="HT32F12xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
      <description>
The Holtek HT32F125x series of devices are high performance, low power consumption 32-bit microcontrollers based on the ARM Cortex-M3 rocessor core. The Cortex-M3 is a next-generation processor core which is tightly coupled with a Nested Vectored Interrupt Controller (NVIC), SysTick timer and advanced debug support.

The HT32F125x device operates at a frequency of up to 72MHz with a Flash accelerator to obtain maximum efficiency. It provides up to 32KB of embedded Flash memory for code/data storage and up to 8 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as ADC, I2C, USART, SPI, SW-DP (Serial Wire Debug Port), etc., are also implemented in this device series. Several power saving modes provide the flexibility  for maximum optimisation between wakeup latency and power consumption, an especially important consideration in low power applications.

The above features make the HT32F125x device suitable for a wide range of applications, especially in areas such as white goods and application control, power monitor and alarm systems, consumer and handheld equipment, data logging applications and so on.
      </description>
      <subFamily DsubFamily="HT32F1251B/51/52/53">
        <compile    header="ARM/INC/Holtek/HT32F125x/ht32f125x.h"/>
        <debug      svd="SVD/HT32F125x.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="VCC"         n="2.70"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="ADC"         n="8"           m="12"/>
        <feature type="AnalogOther" n="2"                               name="OPA/Comparator"/>
        <feature type="Timer"       n="2"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="WDT"         n="1"/>
        <feature type="USART"       n="1"/>
        <feature type="SPI"         n="1"/>
        <feature type="I2C"         n="1"/>
        <device Dname="HT32F1251B">
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <feature type="IOs" n="30"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F1251">
          <feature type="RTC"         n="32768"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
          <feature type="IOs" n="32"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F1252">
          <feature type="RTC"         n="32768"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="32"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
