mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
        <device Dname="HT32F1755_48LQFP">
          <!--<compile    define="USE_MEM_HT32F1755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F1755_64LQFP">
          <!--<compile    define="USE_MEM_HT32F1755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="47"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F1755_100LQFP">
          <!--<compile    define="USE_MEM_HT32F1755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
        <device Dname="HT32F1765">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFN" n="48" name="48QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="100" name="100LQFP"/>
        </device>
        <device Dname="HT32F1765_48QFN">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFN" n="48" name="QFN"/>
        </device>
        <device Dname="HT32F1765_48LQFP">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F1765_64LQFP">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="47"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F1765_100LQFP">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
        <device Dname="HT32F2755">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFN" n="48" name="48QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="100" name="100LQFP"/>
        </device>
        <device Dname="HT32F2755_48QFN">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFN" n="48" name="QFN"/>
        </device>
        <device Dname="HT32F2755_48LQFP">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F2755_64LQFP">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="47"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F2755_100LQFP">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
      </subFamily>
    </family>

