mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
        <device Dname="HT32F52344_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52344"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52344_64LQFP">
          <!--<compile    define="USE_MEM_HT32F52344"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="54"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F52354">
          <!--<compile    define="USE_MEM_HT32F52354"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F52354_33QFN">
          <!--<compile    define="USE_MEM_HT32F52354"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="26"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F52354_46QFN">
          <!--<compile    define="USE_MEM_HT32F52354"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="38"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F52354_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52354"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52354_64LQFP">
          <!--<compile    define="USE_MEM_HT32F52354"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="54"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
      </subFamily>
      <subFamily DsubFamily="HT32F52357/52367">
      <processor Dclock="60000000"/>
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F52357_67"/>
        <debug      svd="SVD/HT32F52357_67.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="1.65"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="6"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="DAC"         n="2"           m="12"/>
        <feature type="AnalogOther" n="2"                               name="Comparator"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="Timer"       n="2"           m="16"              name="PWM"/>
        <feature type="WDT"         n="1"/>
        <feature type="ComOther"    n="2"                               name="SCI"/>
        <feature type="USBD"        n="1"/>
        <feature type="ExtBus"      n="16"                              name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="USART"       n="2"/>
        <feature type="UART"        n="4"/>
        <feature type="SPI"         n="2"                               name="SPI"/>
        <feature type="SPI"         n="1"                               name="QSPI"/>
        <feature type="I2C"         n="2"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <feature type="Other"       n="1"                               name="AES"/>
        <device Dname="HT32F52357">
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="67"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="80" name="80LQFP"/>
        </device>
        <device Dname="HT32F52357_46QFN">
          <!--<compile    define="USE_MEM_HT32F52357"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F52357_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52357"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="39"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52357_64LQFP">
          <!--<compile    define="USE_MEM_HT32F52357"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="53"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F52357_80LQFP">
          <!--<compile    define="USE_MEM_HT32F52357"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="67"/>
          <feature type="QFP" n="80" name="LQFP"/>
        </device>
        <device Dname="HT32F52367">
          <!--<compile    define="USE_MEM_HT32F52367"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="67"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="80" name="80LQFP"/>
        </device>
        <device Dname="HT32F52367_46QFN">
          <!--<compile    define="USE_MEM_HT32F52367"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F52367_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52367"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="39"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52367_64LQFP">
          <!--<compile    define="USE_MEM_HT32F52367"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="53"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F52367_80LQFP">
          <!--<compile    define="USE_MEM_HT32F52367"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="67"/>
          <feature type="QFP" n="80" name="LQFP"/>
        </device>
      </subFamily>
    </family>

  <!-- ************************  Series 'HT32F573xx'  **************************** -->
    <family Dfamily="HT32F573xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="60000000"/>
      <description>
The HOLTEK HT32F573xx devices are high performance, low power consumption 32-bit microcontrollers based around an ARM Cortex-M0+ processor core. The Cortex-M0+ is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer, and including advanced debug support.

The devices operate at a frequency of up to 60 MHz with a Flash accelerator to obtain maximum efficiency. It provides up to 128 KB of embedded Flash memory for code/data storage and 16 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as LCD, ADC, DAC, I2C, USART, UART, SPI, I2S, GPTM, PWM, SCI, CRC-16/32, DIV, AES, RTC, WDT, PDMA, USB2.0 FS, SW-DP (Serial Wire Debug Port), etc., are also implemented in the device series. Several power saving modes provide the flexibility for maximum optimisation between wakeup latency and power consumption, an especially important consideration in low power applications.

The above features ensure that the devices are suitable for use in a wide range of applications, especially in areas such as white goods application control, power monitors, alarm systems, consumer products, handheld equipment, data logging applications, motor control and so on.
      </description>

      <subFamily DsubFamily="HT32F57331/57341">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F57331_41"/>
        <debug      svd="SVD/HT32F57331_41.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="1.65"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="ADC"         n="10"          m="12"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="WDT"         n="1"/>
        <feature type="ComOther"    n="1"                               name="SCI"/>
        <feature type="USBD"        n="1"/>
        <feature type="USART"       n="1"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="2"/>
        <feature type="LCD"         n="1"           m="25.8"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <device Dname="HT32F57331">
          <!--<compile    define="USE_MEM_HT32F57331"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="53"/>
          <feature type="QFP" n="39" name="48LQFP"/>
          <feature type="QFP" n="53" name="64LQFP"/>
        </device>
