mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
        <device Dname="HT32F0008_46QFN">
          <!--<compile    define="USE_MEM_HT32F0008"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="38"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F0008_48LQFP">
          <!--<compile    define="USE_MEM_HT32F0008"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
      </subFamily>
    </family>

  <!-- ************************  Series 'HT32F0006'  **************************** -->
    <family Dfamily="HT32F0006 Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
      <description>
The HOLTEK HT32F0006 device is a high performance, low power consumption 32-bit microcontroller based around an ARM Cortex M0+ processor core. The Cortex M0+ is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer and including advanced debug support.
The device operates at a frequency of up to 48 MHz with a Flash accelerator to obtain maximum efficiency. It provides up to 128 KB of embedded Flash memory for code/data storage and 8 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as ADC, 2-channel DAC, I2C, I2S, USART, UART, SPI, QSPI, GPTM, SCTM, CRC-16/32, RTC, WDT, USB2.0 FS, 32-channel music synthesizer, SW-DP (Serial Wire Debug Port), etc., are also implemented in the device. Several power saving modes provide the flexibility for maximum optimization between wakeup latency and power consumption, an especially important consideration in low power applications.
The HT32F0006 integrates Wave Table synthesis function. It can operate up to 32 channels of Wave Table synthesis at one time and control the MIDI Engine to generate melody by setting the special registers. The Wave Table synthesis waveform is stored in external SPI Flash ROM for application flexibility. With these features, it provides enhanced functions and higher performance.
The above features ensure that the device is suitable for use in a wide range of applications, especially in areas such as electronic organs, digital pianos, electronic drums, electric guitars, electric accordions and so on.
      </description>

      <subFamily DsubFamily="HT32F0006">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F0006"/>
        <debug      svd="SVD/HT32F0006.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.00"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="6"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="16"          m="12"/>
        <feature type="DAC"         n="2"           m="16"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="4"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="WDT"         n="1"/>
        <feature type="USBD"        n="1"/>
        <feature type="USART"       n="1"/>
        <feature type="UART"        n="1"/>
        <feature type="SPI"         n="1"                               name="SPI"/>
        <feature type="SPI"         n="1"                               name="QSPI"/>
        <feature type="I2C"         n="1"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <feature type="Other"       n="1"                               name="Music Synthesis Engine-MSE"/>
        <device Dname="HT32F0006">
          <!--<compile    define="USE_MEM_HT32F0006"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="52"/>
          <feature type="QFP"  n="48" name="48LQFP"/>
          <feature type="QFP"  n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F0006_48LQFN">
          <!--<compile    define="USE_MEM_HT32F0006"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F0006_64LQFP">
          <!--<compile    define="USE_MEM_HT32F0006"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="52"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
      </subFamily>
    </family>

  <!-- ************************  Series 'HT32F61352'  **************************** -->
    <family Dfamily="HT32F61352 Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
      <description>
The HOLTEK HT32F61352 device is a high performance, low power consumption 32-bit microcontroller based around an ARM Cortex M0+ processor core. The Cortex M0+ is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer and including advanced debug support.
The device operates at a frequency of up to 48 MHz with a Flash accelerator to obtain maximum efficiency. It provides up to 128 KB of embedded Flash memory for code/data storage and 8 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as ADC, 2-channel DAC, I2C, I2S, USART, UART, SPI, QSPI, GPTM, SCTM, CRC-16/32, RTC, WDT, USB2.0 FS, 32-channel music synthesizer, SW-DP (Serial Wire Debug Port), etc., are also implemented in the device. Several power saving modes provide the flexibility for maximum optimization between wakeup latency and power consumption, an especially important consideration in low power applications.
The HT32F61352 integrates Wave Table synthesis function. It can operate up to 32 channels of Wave Table synthesis at one time and control the MIDI Engine to generate melody by setting the special registers. The Wave Table synthesis waveform is stored in external SPI Flash ROM for application flexibility. With these features, it provides enhanced functions and higher performance.
The above features ensure that the device is suitable for use in a wide range of applications, especially in areas such as electronic organs, digital pianos, electronic drums, electric guitars, electric accordions and so on.
      </description>

