mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
        <device Dname="HT32F50231_24SSOP">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="19"/>
          <feature type="SOP" n="24" name="SSOP"/>
        </device>
        <device Dname="HT32F50231_28SSOP">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="23"/>
          <feature type="SOP"  n="28" name="SSOP"/>
        </device>
        <device Dname="HT32F50231_28SOP">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="22"/>
          <feature type="SOP"  n="28" name="SOP"/>
        </device>
        <device Dname="HT32F50231_33QFN">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="26"/>
          <feature type="QFN"  n="33" name="QFN"/>
        </device>
        <device Dname="HT32F50231_44LQFP">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="36"/>
          <feature type="QFP"  n="44" name="LQFP"/>
        </device>
        <device Dname="HT32F50231_46QFN">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="38"/>
          <feature type="QFN"  n="46" name="QFN"/>
        </device>
        <device Dname="HT32F50231_48LQFP">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="40"/>
          <feature type="QFP"  n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F50241">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFN" n="24" name="24QFN"/>
          <feature type="SOP" n="24" name="24SSOP"/>
          <feature type="SOP" n="28" name="28SSOP"/>
          <feature type="SOP" n="28" name="28SOP"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFP" n="44" name="44LQFP"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
        </device>
        <device Dname="HT32F50241_24QFN">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="18"/>
          <feature type="QFN" n="24" name="QFN"/>
        </device>
        <device Dname="HT32F50241_24SSOP">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="19"/>
          <feature type="SOP" n="24" name="SSOP"/>
        </device>
        <device Dname="HT32F50241_28SSOP">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="23"/>
          <feature type="SOP"  n="28" name="SSOP"/>
        </device>
        <device Dname="HT32F50241_28SOP">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="22"/>
          <feature type="SOP"  n="28" name="SOP"/>
        </device>
        <device Dname="HT32F50241_33QFN">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="26"/>
          <feature type="QFN"  n="33" name="QFN"/>
        </device>
