mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
        <device Dname="HT32F50241_44LQFP">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="36"/>
          <feature type="QFP"  n="44" name="LQFP"/>
        </device>
        <device Dname="HT32F50241_46QFN">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="38"/>
          <feature type="QFN"  n="46" name="QFN"/>
        </device>
        <device Dname="HT32F50241_48LQFP">
          <!--<compile    define="USE_MEM_HT32F50241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="40"/>
          <feature type="QFP"  n="48" name="LQFP"/>
        </device>
      </subFamily>
    </family>

  <!-- ************************  Series 'HT32F503xx'  **************************** -->
    <family Dfamily="HT32F503xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="60000000"/>
      <description>
The HOLTEK HT32F503xx devices are high performance, low power consumption 32-bit microcontrollers based around an ARM Cortex-M0+ processor core. The Cortex-M0+ is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer, and including advanced debug support.

The devices operate at a frequency of up to 60 MHz with a Flash accelerator to obtain maximum efficiency. It provides up to 64 KB of embedded Flash memory for code/data storage and 12 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as I2C, USART, SPI, SLED, GPTM, SCTM, 8CH-PWM, CRC-16/32, DIV, RTC, WDT, PDMA, USB2.0 FS, SW-DP (Serial Wire Debug Port), etc., are also implemented in the device series. Several power saving modes provide the flexibility for maximum optimisation between wakeup latency and power consumption, an especially important consideration in low power applications.

The above features ensure that the devices are suitable for use in a wide range of applications, especially in areas such as white goods application control, power monitors, alarm systems, consumer products, handheld equipment, data logging applications, motor control and so on.
      </description>

      <subFamily DsubFamily="HT32F50343">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F50343"/>
        <debug      svd="SVD/HT32F50343.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.50"        m="5.50"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="4"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="6"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="3"           m="16"              name="8CH-PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="WDT"         n="1"/>
        <feature type="USBD"        n="1"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="2"/>
        <feature type="Other"       n="2"                               name="SLED"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <device Dname="HT32F50343">
          <!--<compile    define="USE_MEM_HT32F50343"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x010000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x3000"      init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F50343_33QFN">
          <!--<compile    define="USE_MEM_HT32F50343"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <feature type="IOs" n="23"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F50343_46QFN">
          <!--<compile    define="USE_MEM_HT32F50343"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <feature type="IOs" n="35"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F50343_48LQFP">
          <!--<compile    define="USE_MEM_HT32F50343"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F50343_64LQFP">
          <!--<compile    define="USE_MEM_HT32F50343"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x3000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
      </subFamily>
    </family>

  <!-- ************************  Series 'HT32F65240'  **************************** -->
    <family Dfamily="HT32F65240 Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="60000000"/>
      <description>
The HOLTEK HT32F65240 device is high performance, low power consumption 32-bit microcontrollers based around an ARM Cortex-M0+ processor core. The Cortex-M0+ is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer, and including advanced debug support.
The devices operate at a frequency of up to 60 MHz with a Flash accelerator to obtain maximum efficiency. It provides up to 64 KB of embedded Flash memory for code/data storage and 8 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as ADCx2, I2C, USART, UART, SPI, GPTM, MCTM, SCI, CRC-16/32, RTC, WDT, PDMA, CMPx3, OPAx2,  SW-DP (Serial Wire Debug Port), etc., are also implemented in the device series. Several power saving modes provide the flexibility for maximum optimisation between wakeup latency and power consumption.
The HT32F65240 combined with OPA, CMP, DAC and MCTM's brake functions used to OCP protection. In order to implement the FOC algorithm, the MCTM can be used trigger 2 adc to read 2 opa output at the same time for detecting real-time phase current information. The above features ensure that the devices are suitable for use in a FOC algorithm for PMSM motor applications.
      </description>

      <subFamily DsubFamily="HT32F65240">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F65240"/>
        <debug      svd="SVD/HT32F65240.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.5"         m="5.5"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="3"                               name="Run,Sleep,Deep-Sleep"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="6"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="8"           m="12"              name="ADC0/ADC1"/>
        <feature type="AnalogOther" n="2"                               name="OPA"/>
        <feature type="AnalogOther" n="3"                               name="Comparator"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="4"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="WDT"         n="1"/>
        <feature type="USART"       n="1"/>
        <feature type="UART"        n="1"/>
        <feature type="SPI"         n="1"/>
        <feature type="I2C"         n="1"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <device Dname="HT32F65240">
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F65240_LQFP">
          <!--<compile    define="USE_MEM_HT32F65240"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
      </subFamily>
    </family>

