mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
  <!-- ************************  Series 'HT50F32002'  **************************** -->
    <family Dfamily="HT50F32002 Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
      <description>
The HOLTEK HT50F32002 device is a high performance, low power consumption 32-bit microcontroller based around an ARM Cortex M0+ processor core. The Cortex M0+ is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer and including advanced debug support.

TThe devices operate at a frequency of up to 20 MHz for HT32F502xx with a Flash accelerator to obtain maximum efficiency. It provides up to 64 KB of embedded Flash memory for code/data storage and 8 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as ADC, DIV, PDMA, I2C, USART, UART, SPI, MCTM, GPTM, SCTM, CRC-16/32, RTC, WDT, SW-DP (Serial Wire Debug Port), etc., are also implemented in the device series. Several power saving modes provide the flexibility for maximum optimization between wakeup latency and power consumption, an especially important consideration in low power applications.

The above features ensure that the device is suitable for use in a wide range of applications, especially in areas such as electronic organs, digital pianos, electronic drums, electric guitars, electric accordions and so on.
      </description>

      <subFamily DsubFamily="HT50F32002">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT50F32002"/>
        <debug      svd="SVD/HT50F32002.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="20000000"/>
        <feature type="IntRC"       n="20000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.50"        m="5.50"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="4"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="Timer"       n="1"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="WDT"         n="1"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="1"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <device Dname="HT50F32002">
          <!--<compile    define="USE_MEM_HT50F32002"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFN" n="24" name="24QFN"/>
          <feature type="SOP" n="24" name="24SSOP"/>
          <feature type="SOP" n="28" name="28SSOP"/>
          <feature type="SOP" n="28" name="28SOP"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFP" n="44" name="44LQFP"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
        </device>
        <device Dname="HT50F32002_24QFN">
          <!--<compile    define="USE_MEM_HT50F32002"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="18"/>
          <feature type="QFN" n="24" name="QFN"/>
        </device>
        <device Dname="HT50F32002_24SSOP">
          <!--<compile    define="USE_MEM_HT50F32002"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="19"/>
          <feature type="SOP" n="24" name="SSOP"/>
        </device>
        <device Dname="HT50F32002_28SSOP">
          <!--<compile    define="USE_MEM_HT50F32002"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="23"/>
          <feature type="SOP"  n="28" name="SSOP"/>
        </device>
        <device Dname="HT50F32002_28SOP">
          <!--<compile    define="USE_MEM_HT50F32002"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="22"/>
          <feature type="SOP"  n="28" name="SOP"/>
        </device>
        <device Dname="HT50F32002_33QFN">
          <!--<compile    define="USE_MEM_HT50F32002"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="26"/>
          <feature type="QFN"  n="33" name="QFN"/>
        </device>
