mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
    <condition id="HT50Fxxxx CMSIS">                                   <!-- conditions selecting Devices -->
      <description>Holtek HT50Fxxxxx device series, CMSIS-CORE, and ARMCC compiler</description>
      <require Dvendor="Holtek:106" Dname="HT50F*"/>
      <accept Dname="HT50F*"/>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="HT32F1xxxx">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F[12][2][23]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F5xxxx">
      <description>Holtek Cortex-M0+ Standard MCU</description>
      <accept Dname="HT32F[56]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT50Fxxxxx">
      <description>Holtek Cortex-M0+ MCU</description>
      <accept Dname="HT50F*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F125x">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F125[123]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F175x">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F17[56]5*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F1653_54">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F165[34]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F1655_56">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F165[56]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F2755">
      <description>Holtek Cortex-M3 Special-Purpose MUC</description>
      <accept Dname="HT32F2755*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F12345">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F12345*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F12364">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F12364*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F12365_66">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F1236[56]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F22366">
      <description>Holtek Cortex-M3 Special-Purpose MCU</description>
      <accept Dname="HT32F22366*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F50220_30">
      <description>Holtek Cortex-M0+ Standard 5V MCU</description>
      <accept Dname="HT32F502[23]0*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F50231_41">
      <description>Holtek Cortex-M0+ Standard 5V MCU</description>
      <accept Dname="HT32F502[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F50343">
      <description>Holtek Cortex-M0+ Standard 5V MCU USB Line</description>
      <accept Dname="HT32F50343*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52220_30">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[23]0*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52231_41">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52243_53">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[45]3*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52331_41">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52342_52">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[45]2*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52344_54">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[45]4*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52357_67">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[56]7*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F57331_41">
      <description>Holtek Cortex-M0+ Standard MCU LCD Line</description>
      <accept Dname="HT32F573[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F57342_52">
      <description>Holtek Cortex-M0+ Standard MCU LCD Line</description>
      <accept Dname="HT32F573[45]2*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F5826">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F5826*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F0008">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F0008*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52142">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F52142*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F0006">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F0006*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F61352">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F61352*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F65240">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F65240*"/>
      <require condition="Compiler ARM"/>
    </condition>

