mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
    <board vendor="Holtek" name="ESK32-30505 (HT32F52253)" revision="Ver 1.0"
           orderForm="https://www.bestmodulescorp.com/esk32-30505.html">
      <description>Holtek ESK32-30505 HT32F52253 Starter Kit</description>
      <image large="http://mcu.holtek.com.tw/ht32/images/ESK32-30505.jpg"/>
      <book category="overview"  name="https://www.holtek.com/esk32-30505" title="ESK32-30505 Starter Kit Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F52253"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F52243/52253"/>
      <feature type="ODbg"            n="1"              name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="DIO"             n="52"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button"          n="1"              name="Reset Button"/>
      <feature type="LED"             n="5"              name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF"        n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

    <board vendor="Holtek" name="ESK32-30506 (HT32F50230)" revision="Ver 1.1a"
           orderForm="https://www.bestmodulescorp.com/esk32-30506.html">
      <description>Holtek ESK32-30506 HT32F50230 Starter Kit</description>
      <image large="http://mcu.holtek.com.tw/ht32/images/ESK32-30506.jpg"/>
      <book category="overview"  name="https://www.holtek.com/esk32-30506" title="ESK32-30506 Starter Kit Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F50230"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F50220/50230"/>
      <feature type="ODbg"            n="1"              name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL"            n="20000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="DIO"             n="40"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button"          n="1"              name="Reset Button"/>
      <feature type="LED"             n="5"              name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF"        n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

    <board vendor="Holtek" name="ESK32-30507 (HT32F50241)" revision="Ver 1.0"
           orderForm="https://www.bestmodulescorp.com/esk32-30507.html">
      <description>Holtek ESK32-30507 HT32F50241 Starter Kit</description>
      <image large="http://mcu.holtek.com.tw/ht32/images/ESK32-30507.jpg"/>
      <book category="overview"  name="https://www.holtek.com/esk32-30507" title="ESK32-30507 Starter Kit Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F50241"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F50231/50241"/>
      <feature type="ODbg"            n="1"              name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL"            n="20000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="DIO"             n="40"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button"          n="1"              name="Reset Button"/>
      <feature type="LED"             n="5"              name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF"        n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

    <board vendor="Holtek" name="ESK32-30508 (HT32F0008)" revision="Ver 1.1"
           orderForm="https://www.bestmodulescorp.com/esk32-30508.html">
      <description>Holtek ESK32-30508 HT32F0008 Starter Kit</description>
      <image large="http://mcu.holtek.com.tw/ht32/images/ESK32-30508.jpg"/>
      <book category="overview"  name="https://www.holtek.com/esk32-30508" title="ESK32-30508 Starter Kit Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F0008"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F0008"/>
      <feature type="ODbg"            n="1"              name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="DIO"             n="42"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button"          n="1"              name="Reset Button"/>
      <feature type="LED"             n="5"              name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF"        n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

    <board vendor="Holtek" name="ESK32-30509 (HT32F52354)" revision="Ver 1.0"
           orderForm="https://www.bestmodulescorp.com/esk32-30509.html">
      <description>Holtek ESK32-30509 HT32F52354 Starter Kit</description>
      <image large="http://mcu.holtek.com.tw/ht32/images/ESK32-30509.jpg"/>
      <book category="overview"  name="https://www.holtek.com/esk32-30509" title="ESK32-30509 Starter Kit Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F52354"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F52344/52354"/>
      <feature type="ODbg"            n="1"              name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="DIO"             n="54"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button"          n="1"              name="Reset Button"/>
      <feature type="LED"             n="5"              name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF"        n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

  </boards>

  <examples>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30105_HT32F12366/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30105 (HT32F12366)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30106_HT32F12345/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30106 (HT32F12345)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

