mdhardenburgh/Blinky/Packages/.cache/Holtek.HT32_DFP.1.0.20.pdsc
    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30501_HT32F52352/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30501 (HT32F52352)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30502_HT32F52341/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30502 (HT32F52341)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30503_HT32F52241/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30503 (HT32F52241)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30504_HT32F52230/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30504 (HT32F52230)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30505_HT32F52253/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30505 (HT32F52253)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30506_HT32F50230/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30506 (HT32F50230)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30507_HT32F50241/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30507 (HT32F50241)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30508_HT32F0008/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30508 (HT32F0008)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30509_HT32F52354/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30509 (HT32F52354)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

  </examples>

</package>
